In [2]:
import pandas as pd

In [3]:
dict1 = { 'Name': ['Iffat','Ara','Nowshin','Tawsif','Alam','Tonoy'],
'Marks': [87,98,78,90,67,77],
'Gender':['Female','Female','Female','Male','Male','Male']
}
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0    Iffat     87  Female
1      Ara     98  Female
2  Nowshin     78  Female
3   Tawsif     90    Male
4     Alam     67    Male
5    Tonoy     77    Male

**Display Top 3 rows of Dataset**

In [4]:
df1.head(3)

      Name  Marks  Gender
0    Iffat     87  Female
1      Ara     98  Female
2  Nowshin     78  Female

**Display Last 3 rows of Dataset**

In [6]:
df1.tail(3)

     Name  Marks Gender
3  Tawsif     90   Male
4    Alam     67   Male
5   Tonoy     77   Male

**Find Shape of our Dataset (Number of Rows and Number of columns**)

In [8]:
print('Number of rows: ',df1.shape[0])
print('Number of columns: ',df1.shape[1])

Number of rows:  6
Number of columns:  3

**Get information about dataset**

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

**Check Null Values In The Dataset**

In [11]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

**GET OVERALL STATISTICS ABOUT THE DATAFRAME**

In [14]:
df1.describe(include='all')

         Name      Marks  Gender
count       6   6.000000       6
unique      6        NaN       2
top     Iffat        NaN  Female
freq        1        NaN       3
mean      NaN  82.833333     NaN
std       NaN  11.016654     NaN
min       NaN  67.000000     NaN
25%       NaN  77.250000     NaN
50%       NaN  82.500000     NaN
75%       NaN  89.250000     NaN
max       NaN  98.000000     NaN

**Find unique values from the gender column**

In [15]:
df1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

**Find the number of unique values from gender column**

In [16]:
df1['Gender'].nunique()

2

**Display Count of unique values in gender column**

In [19]:
df1['Gender'].value_counts()

Gender
Female    3
Male      3
Name: count, dtype: int64

**Total number of students having marks between 80 to 90 (inclusive) without using between method**

In [25]:
df1[(df1['Marks']>=80) & (df1['Marks']<=90)]

     Name  Marks  Gender
0   Iffat     87  Female
3  Tawsif     90    Male

**Total number of students having marks between 80 to 90 (inclusive) using between method**

In [27]:
df1[df1['Marks'].between(80,90)]

     Name  Marks  Gender
0   Iffat     87  Female
3  Tawsif     90    Male

**Find Average marks**

In [29]:
df1['Marks'].mean()

82.83333333333333

**Customize method**

In [34]:
def marks(x):
    return x//2

In [35]:
df1['Half_marks'] = df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_marks
0    Iffat     87  Female          43
1      Ara     98  Female          49
2  Nowshin     78  Female          39
3   Tawsif     90    Male          45
4     Alam     67    Male          33
5    Tonoy     77    Male          38

In [37]:
df1['Marks'].apply(lambda x:x//2)

0    43
1    49
2    39
3    45
4    33
5    38
Name: Marks, dtype: int64

In [38]:
df1['Name'].apply(len)

0    5
1    3
2    7
3    6
4    4
5    5
Name: Name, dtype: int64

**Map Function**

In [39]:
df1['Male_Female'] = df1['Gender'].map({'Male' :1 , 'Female':0} )
df1

      Name  Marks  Gender  Half_marks  Male_Female
0    Iffat     87  Female          43            0
1      Ara     98  Female          49            0
2  Nowshin     78  Female          39            0
3   Tawsif     90    Male          45            1
4     Alam     67    Male          33            1
5    Tonoy     77    Male          38            1

**Drop the column**

In [40]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half_marks
0    Iffat     87  Female          43
1      Ara     98  Female          49
2  Nowshin     78  Female          39
3   Tawsif     90    Male          45
4     Alam     67    Male          33
5    Tonoy     77    Male          38

**Print name of the columns**

In [46]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks'], dtype='object')

**SORT THE DATAFRAME as per the marks column**

In [48]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender  Half_marks
1      Ara     98  Female          49
3   Tawsif     90    Male          45
0    Iffat     87  Female          43
2  Nowshin     78  Female          39
5    Tonoy     77    Male          38
4     Alam     67    Male          33

**Display Name & Marks of the Female studens only**

In [50]:
df1[df1['Gender'] == 'Female']

      Name  Marks  Gender  Half_marks
0    Iffat     87  Female          43
1      Ara     98  Female          49
2  Nowshin     78  Female          39

In [53]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
0    Iffat     87
1      Ara     98
2  Nowshin     78